Revit 2024 API
ViewShapeBuilder.ViewNormal Property
 Normal of the view that will display the shape being built. Must be set explicitly before adding any geometry. Must be a unit vector. This is used to validate incoming geometry - it must be orthogonal to the viewNormal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public XYZ ViewNormal { get; set; }
Visual Basic
Public Property ViewNormal As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ ViewNormal {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: viewNormal is not length 1.0.
See Also
ViewShapeBuilder Class
Autodesk.Revit.DB Namespace